Examinator/src/Documents/СертификатСУО/СертификатСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>СертификатСУО</name>
  <attributes>
    <name>КомуВыдан</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаЧтоВыдан</name>
    <type>
      <types>DocumentRef</types>
      <types>CatalogRef</types>
    </type>
  </attributes>
  <attributes>
    <name>ДействуетДо</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef</types>
      <types>CatalogRef</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрохождениеОбучения</name>
    <type>
      <types>DocumentRef.ПрохождениеПрограммыОбученияСУО</types>
      <types>DocumentRef.ПрохождениеОбученияСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>Аннулирован</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Отменен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Шаблон</name>
    <type>
      <types>CatalogRef.ШаблоныСертификатовСУО</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Организаторы</name>
    <comment>Заполняется в подписке УстановитьОтветственногоДокументаСУО</comment>
    <attributes>
      <name>Организатор</name>
      <type>
        <types>CatalogRef.ОрганизаторыСУО</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Examinator/src/Documents/СертификатСУО/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийФормы

// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если НЕ Объект.Ссылка.Пустая() И НЕ Объект.Аннулирован Тогда
		Представление = Документы.СертификатСУО.ПредставлениеHTML(Объект.Ссылка);		
	КонецЕсли;
	
	Если ТолькоПросмотр Тогда
		Элементы.ГруппаШапка.Видимость = Ложь;
		Элементы.КомуВыдан.Видимость = Ложь;
		Элементы.ЗаЧтоВыдан.Видимость = Ложь;
		Элементы.ГруппаДополнительно.Видимость = Ложь;
		Элементы.Номер.Видимость = Ложь;
		ПоложениеКоманднойПанели = ПоложениеКоманднойПанелиФормы.Нет;		
	КонецЕсли;
	
	Если НЕ Объект.Ссылка.Пустая() И ЗначениеЗаполнено(Объект.Шаблон) И НЕ Объект.Аннулирован Тогда
		УстановитьПривилегированныйРежим(Истина);
		ЕстьФорматPDF = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Шаблон, "ФорматPDF");
		ЕстьФорматHTML = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Шаблон, "ФорматHTML");
		УстановитьПривилегированныйРежим(Ложь);
	Иначе
		ЕстьФорматPDF = Ложь;
		ЕстьФорматHTML = Ложь;
	КонецЕсли;
	
	Элементы.СохранитьНаДиск.Видимость = ЕстьФорматPDF; 
	Элементы.Представление.Видимость = ЕстьФорматHTML;
	
	АдресСертификатаВВебКабинете = Документы.СертификатСУО.АдресВВебКабинете(Объект.Ссылка, ЕстьФорматHTML);  // Реквизит формы
	Элементы.ОткрытьСертификатВВебКабинете.Видимость = ЗначениеЗаполнено(АдресСертификатаВВебКабинете);
	
КонецПроцедуры


#КонецОбласти


#Область ОбработчикиКомандФормы

// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

&НаКлиенте
Процедура СохранитьНаДиск(Команда)
	ДанныеСертификата = ДанныеСертификатаДляСкачивания(Объект.Ссылка);
	Если ДанныеСертификата = Неопределено Тогда	
		ПоказатьПредупреждение(,НСтр("ru = 'Макет сертификата в формате PDF не задан'"));
	Иначе
		ПолучитьФайл(ДанныеСертификата.АдресХранения, ДанныеСертификата.ИмяФайла, Истина);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаСервере
Функция ДанныеСертификатаДляСкачивания(СсылкаНаСертификат)
	ТребуемыеДанныеШаблона = Новый Структура("ФорматPDF, ФорматHTML", "Шаблон.ФорматPDF", "Шаблон.ФорматHTML");
	Возврат Документы.СертификатСУО.ДанныеСертификатаДляСкачивания(СсылкаНаСертификат, УникальныйИдентификатор);
КонецФункции

&НаКлиенте
Процедура ОткрытьСертификатВВебКабинете(Команда)
	Если ЗначениеЗаполнено(АдресСертификатаВВебКабинете) Тогда
		ПерейтиПоНавигационнойСсылке(АдресСертификатаВВебКабинете);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти
